app/controllers/custom_notifications_controller.rb

  def index
    @custom_notifications = CustomNotification.all
---
SELECT "custom_notifications".* FROM "custom_notifications"

  def show
    @notification = CustomNotification.find(params[:id])
---
SELECT  "custom_notifications".* FROM "custom_notifications" WHERE "custom_notifications"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @notification = CustomNotification.find(params[:id])
---
SELECT  "custom_notifications".* FROM "custom_notifications" WHERE "custom_notifications"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @custom_notification = CustomNotification.new(custom_notification_params)

    respond_to do |format|
      if @custom_notification.save
---
INSERT INTO "custom_notifications" ("user_id", "food_id", "days", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 0], ["food_id", 9], ["days", 1], ["created_at", "2015-05-18 19:17:02.359786"], ["updated_at", "2015-05-18 19:17:02.359786"]]

  def update
    respond_to do |format|
      if @custom_notification.update(custom_notification_params)
---
UPDATE "custom_notifications" SET "user_id" = ?, "updated_at" = ? WHERE "custom_notifications"."id" = ?  [["user_id", 1], ["updated_at", "2015-05-18 19:17:27.558003"], ["id", 1]]

  def destroy
    @custom_notification.destroy
---
DELETE FROM "custom_notifications" WHERE "custom_notifications"."id" = ?  [["id", 1]]

    def set_custom_notification
      @custom_notification = CustomNotification.find(params[:id])
---
SELECT  "custom_notifications".* FROM "custom_notifications" WHERE "custom_notifications"."id" = ? LIMIT 1  [["id", 1]]