app/controllers/food_categories_controller.rb

SELECT "food_categories".* FROM "food_categories"
---
  def index
    @food_categories = FoodCategory.all

INSERT INTO "food_categories" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gum"], ["image", ""], ["created_at", "2015-05-16 19:14:33.862791"], ["updated_at", "2015-05-16 19:14:33.862791"]]
---
  def create
    @food_category = FoodCategory.new(food_category_params)

    respond_to do |format|
      if @food_category.save

UPDATE "food_categories" SET "name" = ?, "updated_at" = ? WHERE "food_categories"."id" = ?  [["name", "fruits"], ["updated_at", "2015-05-16 22:03:42.740384"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @food_category.update(food_category_params)

DELETE FROM "food_categories" WHERE "food_categories"."id" = ?  [["id", 10]]
---
  def destroy
    @food_category.destroy

SELECT  "food_categories".* FROM "food_categories" WHERE "food_categories"."id" = ? LIMIT 1  [["id", 10]]
---
    def set_food_category
      @food_category = FoodCategory.friendly.find(params[:id])